[
  {
    "id": "0",
    "name": "BBVA Compass",
    "shortName": "BBVA Compass",
    "dates": "December 2017 - Present",
    "position": "Full-time",
    "location": "Birmingham, AL",
    "imageUrl": "data/images/bbva.png",
    "description": ["Woring on the Client Vista team",
    "Mainly doing front-end web development, but sometimes helping with automation and back-end",
    "Creating AWS lambdas to gather data and send out emails",
    "Working with AngularJS, Node.js, Git, and MongoDB"],
    "title": "Senior Programmer Analyst"
  },
  {
    "id": "1",
    "name": "Command Alkon",
    "shortName": "Command Alkon",
    "dates": "February 2015 - September 2017",
    "position": "Full-time",
    "location": "Birmingham, AL",
    "imageUrl": "data/images/commandalkon.jpg",
    "description": ["Worked on COMMANDseries Version 3 (international) team and then on the Mobile Development team",
      "Moved to the mobile team to gain experience with web development",
      "Worked with JavaScript, AngularJS, HTML, CSS, and Node.js",
      "Worked with Uniface on the Version 3 team",
      "Built a test suite from scratch using Selenium Webdriver",
      "Used the Agile Scrum software process",
      "Used Visual Studio and Github source control",
      "Used SQL and MongoDB"],
    "title": "Programmer Analyst"
  },
  {
    "id": "2",
    "name": "Lockheed Martin",
    "shortName": "Lockheed Martin",
    "dates": "May 2014 - January 2015",
    "position": "Full-time",
    "location": "Huntsville, AL",
    "imageUrl": "data/images/lockheed.jpg",
    "description": ["Worked on the Targets and Countermeasures team",
      "Worked on Linux software tools",
      "Mostly waiting on my Secret clearance"],
    "title": "Software Engineer Asc."
  },
  {
    "id": "3",
    "name": "Auburn University",
    "shortName": "Auburn University",
    "dates": "January 2014 - May 2014",
    "position": "Part-time",
    "location": "Auburn, AL",
    "imageUrl": "data/images/auburn.jpg",
    "description": ["Worked under Dr. Cheryl Seals whose research areas of expertise are human computer interaction, user interface design, usability evaluation and educational gaming technologies",
      "Visited local elementary and middle schools to work with children to improve computer science education and spark interest in STEM disciplines"],
    "title": "Research Assistant"
  },
  {
    "id": "4",
    "name": "Lockheed Martin",
    "shortName": "Lockheed Martin",
    "dates": "June 2013 - August 2013",
    "position": "Full-time",
    "location": "Huntsville, AL",
    "imageUrl": "data/images/lockheed.jpg",
    "description": ["Worked on the Targets and Countermeasures software engineering team",
      "Responsible for creating a tool in C++ that checked that the values of parameters fell within their expected ranges before being used in the flight software. Both the big and little endian versions used a binary file (containing the actual values) and an excel file (containing the expected ranges) as input, and the incorrect ranges were outputted to the excel file. The ranges were not known so the excel file was also to be used as a reference for the parameter ranges while containing the description, type, units, reference file location, etc. to help with determining the ranges.",
      "Worked with a team to check test and reference data for the newest flight software",
      "Obtained an Interim Secret clearance"],
    "title": "Intern"
  },
  {
    "id": "5",
    "name": "Premier System Integrators",
    "shortName": "Premier",
    "dates": "August 2011 - June 2013",
    "position": "Full-time",
    "location": "Decatur, AL",
    "imageUrl": "data/images/premier.jpg",
    "description": ["Responsible for creating and editing screens in various software packages including AutoCAD, Foxdraw and Wonderware",
      "Created scripted tools to be applied on jobs sites and at the office to make processes easier/faster",
      "Created and edited data, sequence code and ladder logic for different types of PLC blocks",
      "Wrote and edited macros in Excel to be applied at the office to make processes easier/faster",
      "Built and tested systems before being released to the customer"],
    "title": "Co-op engineer"
  }
]
